Revit 2027 API
FamilySymbolProfile.Profile Property
Returns the family symbol of the profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbol Profile { get; set; }
Public Property Profile As FamilySymbol
	Get
	Set
public:
property FamilySymbol^ Profile {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
member Profile : FamilySymbol with get, set
Property Value
FamilySymbol
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
ArgumentException |  Thrown when the category of argument is not BuiltInCategory.OST_ProfileFamilies.
Remarks
The symbol must of the category BuiltInCategory.OST_ProfileFamilies.
See Also
Reference
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace